import json

apps = [
    {
        'name': '中国工商银行',
        'id': 'id423514795'
    },
    {
        'name': '中国建设银行',
        'id': 'id391965015'
    },
    {
        'name': '招商银行',
        'id': 'id392899425'
    },
    {
        'name': '中国农业银行',
        'id': 'id515651240'
    },
    {
        'name': '平安口袋银行',
        'id': 'id1085016815'
    },
    {
        'name': '交通银行',
        'id': 'id337876534'
    },
    {
        'name': '中国银行手机银行',
        'id': 'id399608199'
    },
    {
        'name': '浦发手机银行',
        'id': 'id471855847'
    },
    {
        'name': '邮储手机银行',
        'id': 'id493489515'
    },
    {
        'name': '光大银行手机银行',
        'id': 'id447733826'
    },
    {
        'name': '民生银行手机银行',
        'id': 'id523091708'
    },
    {
        'name': '中信银行手机银行',
        'id': 'id422844108'
    },
    {
        'name': '兴业银行手机银行',
        'id': 'id433592972'
    },
    {
        'name': '网商银行',
        'id': 'id1012867463'
    },
    {
        'name': '江苏银行手机银行',
        'id': 'id518566498'
    },
    {
        'name': '华夏手机银行',
        'id': 'id1473728816'
    },
    {
        'name': '京彩生活—北京银行手机银行客户端',
        'id': 'id434831001'
    },
    {
        'name': '宁波银行',
        'id': 'id531012674'
    },
    {
        'name': '微众银行',
        'id': 'id994103968'
    },
    {
        'name': '南京银行',
        'id': 'id435060143'
    },
    {
        'name': '广发银行手机银行',
        'id': 'id415872960'
    },
    {
        'name': '中国人寿寿险',
        'id': 'id765577833'
    },
    {
        'name': '平安金管家',
        'id': 'id549421060'
    },
    {
        'name': '太平洋保险',
        'id': 'id956403465'
    },
    {
        'name': '泰康在线保险',
        'id': 'id909185021'
    },
    {
        'name': '太平通',
        'id': 'id1440731159'
    },
    {
        'name': '众安保险',
        'id': 'id1019481423'
    }
]

with open('apps_info.json', 'w', encoding='utf-8') as f:
    json.dump(apps, f, ensure_ascii=False)
# with open('apps_info.json','r',encoding='utf-8') as f:
#     print(json.load(f))